In [4]:

import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns 
from sklearn.model_selection import train_test_split

pd.set_option('display.float_format', lambda x: '{:.2f}'.format(x))
np.set_printoptions(suppress=True)

### Load data

In [5]:
df_customers = pd.read_csv("../dataset/customers.csv")
df_loans = pd.read_csv("../dataset/loans.csv")
df_bureau = pd.read_csv("../dataset/bureau_data.csv")

In [6]:
df_customers.shape, df_loans.shape, df_bureau.shape

((50000, 12), (50000, 15), (50000, 8))

In [7]:
df_customers.head(3)

  cust_id  age gender  ...     city        state  zipcode
0  C00001   44      M  ...    Delhi        Delhi   110001
1  C00002   38      M  ...  Chennai   Tamil Nadu   600001
2  C00003   46      F  ...  Kolkata  West Bengal   700001

[3 rows x 12 columns]

In [8]:
df_loans.head(3)

  loan_id cust_id loan_purpose  ... disbursal_date  installment_start_dt  default
0  L00001  C00001         Auto  ...     2019-07-24            2019-08-10    False
1  L00002  C00002         Home  ...     2019-07-24            2019-08-15    False
2  L00003  C00003     Personal  ...     2019-07-24            2019-08-21    False

[3 rows x 15 columns]

In [11]:
df = pd.merge(df_customers, df_loans, on='cust_id')
df.head(3)

  cust_id  age gender  ... disbursal_date installment_start_dt  default
0  C00001   44      M  ...     2019-07-24           2019-08-10    False
1  C00002   38      M  ...     2019-07-24           2019-08-15    False
2  C00003   46      F  ...     2019-07-24           2019-08-21    False

[3 rows x 26 columns]

In [12]:
df = pd.merge(df, df_bureau, on='cust_id')
df.head(3)

  cust_id  age gender  ... total_dpd enquiry_count  credit_utilization_ratio
0  C00001   44      M  ...         0             3                         7
1  C00002   38      M  ...        60             5                         4
2  C00003   46      F  ...       147             6                        58

[3 rows x 33 columns]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 33 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   cust_id                      50000 non-null  object
 1   age                          50000 non-null  int64
 2   gender                       50000 non-null  object
 3   marital_status               50000 non-null  object
 4   employment_status            50000 non-null  object
 5   income                       50000 non-null  int64
 6   number_of_dependants         50000 non-null  int64
 7   residence_type               49938 non-null  object
 8   years_at_current_address     50000 non-null  int64
 9   city                         50000 non-null  object
 10  state                        50000 non-null  object
 11  zipcode                      50000 non-null  int64
 12  loan_id                      50000 non-null  object
 13  loan_purpose                 50000 non-null  object
 14  loan_type                    50000 non-null  object
 15  sanction_amount              50000 non-null  int64
 16  loan_amount                  50000 non-null  int64
 17  processing_fee               50000 non-null  float64
 18  gst                          50000 non-null  int64
 19  net_disbursement             50000 non-null  int64
 20  loan_tenure_months           50000 non-null  int64
 21  principal_outstanding        50000 non-null  int64
 22  bank_balance_at_application  50000 non-null  int64
 23  disbursal_date               50000 non-null  object
 24  installment_start_dt         50000 non-null  object
 25  default                      50000 non-null  bool
 26  number_of_open_accounts      50000 non-null  int64
 27  number_of_closed_accounts    50000 non-null  int64
 28  total_loan_months            50000 non-null  int64
 29  delinquent_months            50000 non-null  int64
 30  total_dpd                    50000 non-null  int64
 31  enquiry_count                50000 non-null  int64
 32  credit_utilization_ratio     50000 non-null  int64
dtypes: bool(1), float64(1), int64(19), object(12)
memory usage: 12.3+ MB

In [15]:
df['default'] = df['default'].astype(int)
df.default.value_counts()

default
0    45703
1     4297
Name: count, dtype: int64